{
    "locales": {
        "en": {
            "title": "Education",
            "title_long_prefix": "This is my",
            "title_long": "**Educational** Background"
        },

        "es": {
            "title": "Educación",
            "title_long_prefix": "Esta es mi",
            "title_long": "**Formación** Educativa"
        }
    },

    "articles": [
        {
            "id": "academic",
            "component": "ArticleTimeline",
            "config": {},
            "locales": {},

            "items": [
                {
                    "icon": {
                        "img": "images/pictures/place-5.jpeg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "06/01/2024",
                        "end": "12/01/2024"
                    },
                    "locales": {
                        "en": {
                            "title": "**Diploma course** in linux server administration",
                            "info": "UNAD",
                            "text": "<p> <strong>I completed a Diploma in Linux Server Administration,</strong> where I gained in-depth knowledge and practical skills in managing and administering Linux-based servers. This program focused on the configuration, security, and maintenance of Linux servers, preparing me to effectively manage infrastructure in various environments. </p> <ul> <li><strong>Server installation and configuration:</strong> Learned to install, configure, and optimize Linux servers to ensure high performance and availability.</li> <li><strong>User and permission management:</strong> Developed skills to manage users, groups, and permissions for maintaining security and access control in Linux systems.</li> <li><strong>Network services management:</strong> Gained experience in configuring and managing network services such as DNS, DHCP, and web servers like Apache and Nginx.</li> <li><strong>Security and firewall management:</strong> Implemented security measures such as firewalls, SSH, and system hardening techniques to protect Linux servers from unauthorized access.</li> <li><strong>Automation and scripting:</strong> Learned to use bash scripting and automation tools to streamline server management tasks and improve efficiency.</li> </ul> <p> This diploma provided me with the expertise to effectively manage Linux servers in production environments. I acquired both theoretical and practical skills in server administration, which equipped me to optimize performance, ensure security, and automate routine tasks. These skills allow me to confidently manage Linux-based infrastructure and address the challenges of system administration in modern IT environments. </p>",
                            "tags": ["Linux", "Server Administration", "Security", "Bash Scripting", "Automation"]
                        },
                        "es": {
                            "title": "**Diplomado** en administración de servidores linux",
                            "info": "UNAD",
                            "text": "<p> <strong>Completé un Diplomado en Administración de Servidores Linux,</strong> donde adquirí conocimientos profundos y habilidades prácticas en la gestión y administración de servidores basados en Linux. Este programa se centró en la configuración, seguridad y mantenimiento de servidores Linux, preparándome para gestionar de manera efectiva la infraestructura en diversos entornos. </p> <ul> <li><strong>Instalación y configuración de servidores:</strong> Aprendí a instalar, configurar y optimizar servidores Linux para garantizar un alto rendimiento y disponibilidad.</li> <li><strong>Gestión de usuarios y permisos:</strong> Desarrollé habilidades para gestionar usuarios, grupos y permisos, manteniendo la seguridad y el control de acceso en los sistemas Linux.</li> <li><strong>Gestión de servicios de red:</strong> Adquirí experiencia en la configuración y administración de servicios de red como DNS, DHCP y servidores web como Apache y Nginx.</li> <li><strong>Seguridad y gestión de firewall:</strong> Implementé medidas de seguridad como firewalls, SSH y técnicas de endurecimiento del sistema para proteger los servidores Linux de accesos no autorizados.</li> <li><strong>Automatización y scripting:</strong> Aprendí a utilizar scripting en bash y herramientas de automatización para agilizar las tareas de administración de servidores y mejorar la eficiencia.</li> </ul> <p> Este diplomado me proporcionó la experiencia necesaria para gestionar eficazmente servidores Linux en entornos de producción. Adquirí habilidades tanto teóricas como prácticas en administración de servidores, lo que me permite optimizar el rendimiento, garantizar la seguridad y automatizar tareas rutinarias. Estas habilidades me permiten gestionar con confianza la infraestructura basada en Linux y enfrentar los desafíos de la administración de sistemas en entornos de TI modernos. </p>",
                            "tags": null
                        }
                    }
                },
                {
                    "icon": {
                        "img": "images/pictures/place-5.jpeg",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "01/01/2018",
                        "end": "12/01/2022"
                    },
                    "locales": {
                        "en": {
                            "title": "**Systems Engineering**",
                            "info": "UNAD",
                            "text": "<p> <strong>I completed the Systems Engineering program at the Universidad Nacional Abierta y a Distancia (UNAD),</strong> which provided me with comprehensive training in software development, systems management, and emerging technologies. Throughout this program, I acquired skills in designing, implementing, and managing technological solutions for various sectors, applying agile methodologies and international standards in software engineering. </p> <ul> <li><strong>Software development:</strong> Mastered the software development life cycle, including analysis, design, programming, and system testing, using languages such as Java, Python, and PHP.</li> <li><strong>Systems and network administration:</strong> Learned to manage network environments, server configurations, and operating systems to ensure efficient operation.</li> <li><strong>Cybersecurity:</strong> Developed skills to protect systems and data against cyber threats by applying cybersecurity principles and best practices in network security.</li> <li><strong>Databases:</strong> Advanced management in creating, managing, and optimizing relational and non-relational databases, using technologies such as MySQL and MongoDB.</li> <li><strong>Agile methodologies:</strong> Applied methodologies like Scrum and Kanban in software development projects, ensuring fast and high-quality deliveries.</li> </ul> <p> This program provided me with a deep understanding of current technologies and methodologies in the field of systems engineering. I learned to design innovative technological solutions, optimize systems, and manage software projects with a focus on quality, security, and efficiency. The practical and theoretical approach prepared me to face real-world challenges, work in teams, and use modern development tools. </p>",
                            "tags": ["Visual Basic", "PHP", "SQL", "Angular", "Java", "Android Studio"]
                        },
                        "es": {
                            "title": "**Ingeniero** en sistemas",
                            "info": "UNAD",
                            "text": "<p> <strong>Completé el programa de Ingeniería de Sistemas en la Universidad Nacional Abierta y a Distancia (UNAD),</strong> el cual me brindó una formación integral en el desarrollo de software, administración de sistemas y tecnologías emergentes. Durante este programa, adquirí habilidades en el diseño, implementación y gestión de soluciones tecnológicas para diferentes sectores, aplicando metodologías ágiles y estándares internacionales en el ámbito de la ingeniería de software. </p>  <ul> <li><strong>Desarrollo de software:</strong> Dominé el ciclo de vida de desarrollo de software, incluyendo análisis, diseño, programación y pruebas de sistemas, utilizando lenguajes como Java, Python y PHP.</li> <li><strong>Administración de sistemas y redes:</strong> Aprendí a gestionar entornos de red, configuración de servidores y administración de sistemas operativos para asegurar su funcionamiento eficiente.</li> <li><strong>Seguridad informática:</strong> Desarrollé habilidades para proteger sistemas y datos frente a amenazas cibernéticas, aplicando principios de ciberseguridad y buenas prácticas de seguridad en redes.</li> <li><strong>Bases de datos:</strong> Manejo avanzado en la creación, gestión y optimización de bases de datos relacionales y no relacionales, utilizando tecnologías como MySQL y MongoDB.</li> <li><strong>Metodologías ágiles:</strong> Apliqué metodologías como Scrum y Kanban en el desarrollo de proyectos de software, asegurando entregas rápidas y de alta calidad.</li> </ul> <p> Este programa me proporcionó una comprensión profunda de las tecnologías y metodologías actuales en el campo de la ingeniería de sistemas. Aprendí a diseñar soluciones tecnológicas innovadoras, optimizar sistemas y gestionar proyectos de software con enfoque en la calidad, seguridad y eficiencia. El enfoque práctico y teórico me preparó para enfrentar los desafíos del mundo real, trabajando en equipo y utilizando herramientas modernas de desarrollo. </p>",
                            "tags": null
                        }
                    }
                },

                {
                    "icon": {
                        "img": "images/pictures/place-6.png",
                        "fa": "",
                        "faColors": {"bg": null, "fill": null}
                    },
                    "dates": {
                        "start": "01/01/2010",
                        "end": "08/01/2014"
                    },
                    "locales": {
                        "en": {
                            "title": "**Technician** in production processes",
                            "info": "Corunivertisitec",
                            "text": "<p>I completed a training program in Industrial Production Process Technology, which provided me with a solid foundation in the optimization of production processes, efficient resource management and continuous improvement in the industrial environment. During this program, I acquired technical and management skills, aimed at ensuring efficiency and quality in production processes.</p> <ul> <li>Workflow analysis</li> <li>Creating effective processes</li> <li>Production process optimization</li> <li>Quality management and continuous improvement</li> </ul> <p> The Industrial Production Process Technology program not only allowed me to acquire technical knowledge, but also a mindset oriented towards continuous improvement. I learned to implement optimization strategies, efficiently manage resources and work as a team to overcome today's industrial challenges.</p>",
                            "tags": []
                        },
                        "es": {
                            "title": "**Tecnologo** en procesos de producción",
                            "info": "Corunivertisitec",
                            "text": "<p>Completé un programa de formación en Tecnología en Procesos de Producción Industrial, que me brindó una sólida base en la optimización de procesos productivos, la gestión eficiente de recursos y la mejora continua en el ámbito industrial. Durante este programa, adquirí habilidades técnicas y de gestión, orientadas a garantizar la eficiencia y calidad en los procesos productivos.</p> <ul><li>Análisis de flujos de trabajo</li> <li>Creación de procesos efectivos</li> <li>Optimización de procesos productivos</li> <li>Gestión de la calidad y mejora continua</li> </ul> <p>El programa de Tecnología en Procesos de Producción Industrial no solo me permitió adquirir conocimientos técnicos, sino también una mentalidad orientada a la mejora continua. Aprendí a implementar estrategias de optimización, gestionar de manera eficiente los recursos y a trabajar en equipo para superar los desafíos industriales actuales.</p>",
                            "tags": []
                        }
                    }
                }
            ]
        }
    ]
}